const quote = document.querySelector(".quote");
const author = document.querySelector(".author");

const quotes = [
  {
    content:
      "بزرگترین شکوه در زندگی این نیست که هرگز زمین نخوریم، بلکه در این است که هر بار که زمین می‌خوریم برخیزیم.",
    author: "نلسون ماندلا",
  },
  {
    content: "راه شروع این است که حرف زدن را کنار بگذارید و شروع به عمل کنید.",
    author: "والت دیزنی",
  },
  {
    content:
      "زمان شما محدود است، پس آن را با زندگی کردن به جای دیگران هدر ندهید.",
    author: "استیو جابز",
  },
  {
    content: "اگر زندگی قابل پیش‌بینی بود، دیگر زندگی نمی‌شد و بی‌مزه بود.",
    author: "النور روزولت",
  },
  {
    content:
      "اگر به داشته‌های خود در زندگی نگاه کنید، همیشه بیشتر خواهید داشت. اگر به نداشته‌های خود نگاه کنید، هرگز کافی نخواهید داشت.",
    author: "اوپرا وینفری",
  },
  {
    content:
      "اگر اهداف خود را به شدت بلند بگذارید و شکست بخورید، بالاتر از موفقیت دیگران شکست خواهید خورد.",
    author: "جیمز کامرون",
  },
  {
    content:
      "زندگی چیزی است که وقتی در حال برنامه‌ریزی برای چیزهای دیگر هستید، اتفاق می‌افتد.",
    author: "جان لنون",
  },
  {
    content:
      "عشق را در هر جا که می‌روید پراکنده کنید. بگذارید هیچ‌کس بدون خوشحال شدن از نزد شما نرود.",
    author: "مادر ترزا",
  },
  {
    content:
      "هر روز را با برداشت محصول ارزیابی نکنید، بلکه با دانه‌هایی که کاشته‌اید ارزیابی کنید.",
    author: "رابرت لوئیس استیونسون",
  },
  {
    content: "آینده متعلق به کسانی است که به زیبایی رویاهای خود ایمان دارند.",
    author: "النور روزولت",
  },
];

function showRandomQuote() {
  const randomQuoteIndex = Math.floor(Math.random() );
  const mainQuote = quotes[randomQuoteIndex];

  quote.innerHTML = mainQuote.content;
  author.innerHTML = mainQuote.author;
}
